title: Detect AMSI Disabling and Obfuscation via Memory Manipulation
description: Detects attempts to disable AMSI by manipulating memory in a process and use of obfuscation techniques.
status: experimental
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    EventID: 1
    Image: '*\powershell.exe'
    CommandLine: '*GetProcAddress*amsi.dll*AmsiScanBuffer'
  selection2:
    EventID: 10
    SourceImage: '*\powershell.exe'
    TargetImage: '*\amsi.dll'
    GrantedAccess: '*0x40*'
  selection3:
    EventID: 1
    Image: '*\powershell.exe'
    CommandLine: '*-EncodedCommand*'
  selection4:
    EventID: 1
    Image: '*\powershell.exe'
    CommandLine: '*-e*'
  condition: (selection1 and selection2) or (selection3 and selection4)
level: high
author: Camilo Burgos
date: 2023-07-27
